using System.ComponentModel;

namespace Domain.Enums
{
    /// <summary>
    /// نوع صورتحساب الکترونیکی
    /// </summary>
    public enum TaxInvoiceType
    {
        /// <summary>
        /// نوع اول
        /// <para>
        /// در این نوع صورتحساب اطلاعات کامل خریدار و فروشنده ثبت میگردد. این اطلاعات شامل: نوع فروش 2، نوع
        /// خریدار، تاریخ و زمان صدور صورتحساب، اطلاعات هویتی خریدار و فروشنده، مشخصات کالا/خدمت میباشد.
        /// باتوجه به اینکه در این نوع از صورتحسابهای الکترونیکی، اطلاعات هویتی خریدار درج میشود، صورتحساب
        /// پس از صدور و ثبت در سامانه مودیان، اعتبارسنجی و پذیرش توسط سامانه، بر اساس شماره اقتصادی در کارپوشه
        /// خریدار درج گردیده و در صورت تایید خریدار به عنوان اعتبار مالیاتی برای ایشان محسوب خواهد گردید
        /// </para>
        /// </summary>
        [Description("صورتحساب الکترونیکی نوع اول")]
        Type1 = 1,


        /// <summary>
        /// نوع دوم
        /// <para>
        /// صورتحسابی است با اطلاعات کامل فروشنده و کالا/خدمت.در این نوع از صورتحساب، ثبت اطلاعات خریدار
        /// اختیاری بوده واز بابت این صورتحساب اعتبار مالیاتی برای خریدار قابل احتساب نمیباشد.
        /// </para>
        /// </summary>
        [Description("صورتحساب الکترونیکی نوع دوم")]
        Type2 = 2,


        /// <summary>
        /// نوع سوم
        /// <para>
        /// این نوع از صورتحساب الکترونیکی، همان رسید پرداخت وجه صادره از دستگاه کارتخوان بانکی یا درگاه
        /// الکترونیکی پرداخت که حسب مقررات اعلامی سازمان امور مالیاتی کشور، به عنوان پایانه فروشگاهی فروشنده
        /// )مودی( پذیرفته میشوند، میباشند. در این نوع از صورتحسابهای الکترونیکی صرفاً مبلغ پرداختی و مشخصات
        /// پذیرنده )شماره سوییچ، شماره پذیرنده، شماره پایانه(، شماره پیگیری، تاریخ و زمان پرداخت و حداقل مشخصات
        /// فروشنده وجود داشته و از بابت آن اعتبار مالیاتی برای خریدار قابل احتساب نمیباشد 1 . شایان ذکر است، این نوع
        /// از صورتحساب الکترونیکی نیز دارای شماره منحصر به فرد مالیاتی می باشد.
        /// </para>
        /// </summary>
        [Description("صورتحساب الکترونیکی نوع سوم")]
        Type3 = 3
    }
}
